vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32655.pdsc
      <example name="LP" doc="ARM/Abstract.txt" folder="Examples/MAX32655/LP">
         <description>Low Power Capabilities Demo</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/LP.ewp" />
            <environment name="uv" load="ARM/LP.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Low Power"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="RTC" doc="ARM/Abstract.txt" folder="Examples/MAX32655/RTC">
         <description>Real Time Clock Demo</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/RTC.ewp" />
            <environment name="uv" load="ARM/RTC.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="RTC" />
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 

      <example name="SPI" doc="ARM/Abstract.txt" folder="Examples/MAX32655/SPI">
         <description>SPI Demo</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/SPI.ewp" />
            <environment name="uv" load="ARM/SPI.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>          
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="SPI"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>      
      </example>

	  <example name="TFT" doc="ARM/Abstract.txt" folder="Examples/MAX32655/TFT_Demo">
         <description>TFT Demo</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/TFT_Demo.ewp" />
            <environment name="uv" load="ARM/TFT_Demo.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="TFT"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 	
	  
      <example name="TMR" doc="ARM/Abstract.txt" folder="Examples/MAX32655/TMR">
         <description>Timer Demo</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/TMR.ewp" />
            <environment name="uv" load="ARM/TMR.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="TRNG" doc="ARM/Abstract.txt" folder="Examples/MAX32655/TRNG">
         <description>Semaphore Module Demo</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/TRNG.ewp" />
            <environment name="uv" load="ARM/TRNG.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="TRNG"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>           

      <example name="UART" doc="ARM/Abstract.txt" folder="Examples/MAX32655/UART">
         <description>UART Demo</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/UART.ewp" />
            <environment name="uv" load="ARM/UART.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="UART"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 

