vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32655.pdsc
      <example name="Watchdog" doc="ARM/Abstract.txt" folder="Examples/MAX32655/Watchdog">
         <description>Watchdog Demo</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Watchdog.ewp" />
            <environment name="uv" load="ARM/Watchdog.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="WDT"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 

      <example name="WUT" doc="ARM/Abstract.txt" folder="Examples/MAX32655/WUT">
         <description>Wakeup Timer Demo</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/WUT.ewp" />
            <environment name="uv" load="ARM/WUT.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="WUT"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 	  

      <example name="Pulse_Train" doc="ARM/Abstract.txt" folder="Examples/MAX32655/Pulse_Train">
         <description>Pulse Train Demo</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Pulse_Train.ewp" />
            <environment name="uv" load="ARM/Pulse_Train.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="PT"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="I2S" doc="ARM/Abstract.txt" folder="Examples/MAX32655/I2S">
         <description>I2S Demo</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/I2S.ewp" />
            <environment name="uv" load="ARM/I2S.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="I2S"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
	  
<!-- BLE Added here -->	  
      <example name="BTLE Dats" doc="ARM/Abstract.txt" folder="Examples/MAX32655/BLE_dats">
         <description>BTLE Data Server Demo</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_dats.ewp" />
            <environment name="uv" load="ARM/BTLE_dats.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>
	  	  
	  
      <example name="BTLE Fit" doc="ARM/Abstract.txt" folder="Examples/MAX32655/BLE_fit">
         <description>BTLE Data Server Demo</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_fit.ewp" />
            <environment name="uv" load="ARM/BTLE_fit.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>	  
	  	  
 	  
      <example name="BTLE Datc" doc="ARM/Abstract.txt" folder="Examples/MAX32655/BLE_datc">
         <description>BTLE Data Client Demo</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_datc.ewp" />
            <environment name="uv" load="ARM/BTLE_datc.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>	  
	  
      <example name="BTLE BLE4 ctr" doc="ARM/Abstract.txt" folder="Examples/MAX32655/BLE4-ctr">
         <description>BTLE BLE4 Controller</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BTLE_BLE4_ctr.ewp" />
            <environment name="uv" load="ARM/BTLE_BLE4_ctr.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>

      <example name="BTLE BLE5 ctr" doc="ARM/Abstract.txt" folder="Examples/MAX32655/BLE5-ctr">
         <description>BTLE BLE5 Controller</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BTLE_BLE5_ctr.ewp" />
            <environment name="uv" load="ARM/BTLE_BLE5_ctr.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>  
	  
