vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32655.pdsc
<!--	  
      <example name="BTLE fit" doc="ARM/Abstract.txt" folder="Libraries/Cordio/ble-apps/build/fit">
         <description>BTLE fit Demo</description>
         <board name="MAX32655 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_dats.ewp" />
            <environment name="uv" load="ARM/BTLE_fit.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32655 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32655 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>
-->	  

	
<!-- BLE Added here -->
	  
   </examples>

   <conditions>
      <!-- MAX32655 Device Condition -->
      <condition id="MAX32655 Family">
         <description> Maxim Integrated MAX32655 device family</description>
         <require Dvendor="Maxim:23"/>
		 <require Dname="MAX32655"/>
      </condition>

      <!-- MAX32655 Device Condition -->
      <condition id="MAX32655 Device">
         <description> Maxim Integrated MAX32655 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32655"/>
      </condition>

      <!-- MAX32656 Device Condition -->
<!--      <condition id="MAX32656 Device">
         <description> Maxim Integrated MAX32655 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32656"/>
      </condition> -->

      <!-- MAX32655/51/52 CMSIS-CORE Condition -->
      <condition id="MAX32655 CMSIS-CORE">
         <description>Maxim MAX32655 Series devices and CMSIS-CORE</description>
         <require Cclass="CMSIS" Cgroup="CORE"/>
         <require condition="MAX32655 Family"/>
<!--         <accept condition="MAX32656 Device"/> -->
		 <accept condition="MAX32655 Device"/>
         <require Cclass="Device" Cgroup="Startup"/>
      </condition>

      <!-- GNUC/Eclipse Compiler Condition -->
      <condition id="Startup GCC">
         <description>Startup files for the GNU C Toolchain</description>
         <require Tcompiler="GCC"/>
      </condition>

      <!-- IAR Embedded Workbench Compiler Condition -->
      <condition id="Startup ARM">
         <description>Startup files for the KEIL Embedded Workbench Toolchain</description>
         <require Tcompiler="ARMCC"/>
      </condition> 
      <condition id="Startup IAR">
         <description>Startup files for the IAR Embedded Workbench Toolchain</description>
         <require Tcompiler="IAR"/>
      </condition>

      <!-- ADC Peripheral Condition -->
      <condition id="MAX32655 CMSIS ADC">
         <description>ADC Interface</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>
	  
      <!-- TFT Peripheral Condition -->
      <condition id="MAX32655 CMSIS TFT">
         <description>TFT Interface</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>	  

      <!-- AES Peripheral Condition -->
      <condition id="MAX32655 CMSIS AES">
         <description>AES Interface</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>
	  
      <!-- CRC Peripheral Condition -->
      <condition id="MAX32655 CMSIS CRC">
         <description>CRC</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>	
	
      <!-- Standard DMA Peripheral -->
      <condition id="MAX32655 CMSIS DMA">
         <description>Standard DMA</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>	  

      <!-- FLash Controller Peripheral -->
      <condition id="MAX32655 CMSIS FLC">
         <description>Internal Flash Controller</description>
         <require condition="MAX32655 CMSIS-CORE"/>
         <require condition="MAX32655 CMSIS ICC"/>
      </condition>

      <!-- GPIO -->
      <condition id="MAX32655 CMSIS GPIO">
         <description>GPIO</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>

      <!-- I2C -->
      <condition id="MAX32655 CMSIS I2C">
         <description>I2C Interface</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>

      <!-- I2S -->
      <condition id="MAX32655 CMSIS I2S">
         <description>I2S Interface</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>

      <!-- ICC -->
      <condition id="MAX32655 CMSIS ICC">
         <description>Instruction Cache Controller</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>

      <!-- Low Power -->
      <condition id="MAX32655 CMSIS Low Power">
         <description>Low Power API</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>

      <!-- RTC -->
      <condition id="MAX32655 CMSIS RTC">
         <description>Real-Time Clock</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>

      <!-- SPI Peripheral -->
      <condition id="MAX32655 CMSIS SPI">
         <description>SPI Interface</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>

      <!-- SYS -->
      <condition id="MAX32655 CMSIS SYS">
         <description>SYS Interface</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>

      <!-- Timer -->
      <condition id="MAX32655 CMSIS TIMER">
         <description>Timers</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>

      <!-- TRNG -->
      <condition id="MAX32655 CMSIS TRNG">
         <description>Timers</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>

      <!-- UART -->
      <condition id="MAX32655 CMSIS UART">
         <description>UART</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>

      <!-- WDT -->
      <condition id="MAX32655 CMSIS WDT">
         <description>Watchdog Timers</description>
         <require condition="MAX32655 CMSIS-CORE"/>
      </condition>
	  
