vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32655.pdsc
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_dtm.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_pdufilt.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_periodiclist.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_reslist.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_sniffer.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_whitelist.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/init/init.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/init/init_ctr.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_adv_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_adv_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_adv_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_adv_slave_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_bis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_bis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_cis.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_cis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_cis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_conn.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_conn_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_conn_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_conn_past.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_enc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_enc_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_init_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_init_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_pc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_act_phy.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_isr_adv_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_isr_adv_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_isr_adv_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_isr_adv_slave_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_isr_bis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_isr_bis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_isr_cis.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_isr_cis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_isr_cis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_isr_conn.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_isr_conn_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_isr_conn_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_isr_init_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_isr_init_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_adv_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_adv_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_adv_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_adv_slave_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_bis.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_bis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_bis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_cis.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_cis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_cis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_conn.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_conn_cs2.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_conn_data.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_conn_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_conn_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_enc_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_enc_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_init_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_init_master_ae.c"/>
                <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_iso.c"/> 
                <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_iso_data.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_master_phy.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_past.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_pc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_priv.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_sc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_main_slave_phy.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_pdu_adv_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_pdu_adv_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_pdu_adv_slave_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_pdu_bis.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_pdu_conn.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_pdu_enc.c"/>
                <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_pdu_iso.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_adv_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_adv_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_adv_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_adv_slave_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_bis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_bis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_cis.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_conn_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_conn_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_init_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_init_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_llcp_cis.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_llcp_cis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_llcp_cis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_llcp_conn.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_llcp_conn_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_llcp_conn_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_llcp_enc_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_llcp_enc_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_llcp_master_phy.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_llcp_pc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lctr/lctr_sm_llcp_slave_phy.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_adv_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_adv_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_adv_priv.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_adv_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_adv_slave_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_bis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_bis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_cis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_cis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_conn.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_conn_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_conn_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_conn_priv.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_enc_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_enc_slave.c"/>
                <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_iso.c"/>  
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_past.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_pc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_phy.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_sc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_vs.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_vs_adv_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_vs_adv_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_vs_adv_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_vs_adv_slave_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_vs_conn.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_vs_conn_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_vs_enc_slave.c"/>
                <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_vs_iso.c"/>  
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_cmd_vs_sc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_adv_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_adv_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_adv_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_adv_slave_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_bis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_bis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_cis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_cis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_conn.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_conn_cs2.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_conn_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_conn_priv.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_enc_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_enc_slave.c"/>
                <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_iso.c"/>  
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_pc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_phy.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_sc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_evt_vs.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_adv_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_adv_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_adv_priv.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_adv_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_adv_slave_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_bis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_bis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_cis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_cis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_conn.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_conn_cs2.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_conn_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_conn_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_conn_priv.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_enc_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_enc_slave.c"/>
                <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_iso.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_past.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_pc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_phy.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_init_sc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_main.c"/>
              <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lhci/lhci_main_iso.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_adv_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_adv_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_adv_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_adv_slave_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_bis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_bis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_cis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_cis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_conn_cs2.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_conn_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_conn_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_enc_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_enc_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_init_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_init_master_ae.c"/>
                <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_iso.c"/>  
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_master_phy.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_past.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_pc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_priv.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_sc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_init_slave_phy.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_adv_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_adv_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_adv_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_adv_slave_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_bis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_bis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_cis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_cis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_conn.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_conn_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_conn_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_conn_slave.c"/>
