vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32655.pdsc
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_diag.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_dtm.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_enc_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_enc_slave.c"/>
                <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_iso.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_past.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_pc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_phy.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_priv.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_main_sc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/ll/ll_math.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lmgr/lmgr_events.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lmgr/lmgr_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lmgr/lmgr_main_adv_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lmgr/lmgr_main_adv_slave_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lmgr/lmgr_main_cis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lmgr/lmgr_main_conn.c"/>
                <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lmgr/lmgr_main_iso.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lmgr/lmgr_main_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lmgr/lmgr_main_priv.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lmgr/lmgr_main_sc.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/lmgr/lmgr_main_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/sch/sch_ble.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/sch/sch_rm.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/sch/sch_tm.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/common/bb/bb_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/common/chci/chci_tr.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/common/sch/sch_list.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/common/sch/sch_main.c"/>
              <file category="sourceC" name="Libraries/Cordio/platform/targets/maxim/max32655/sources/pal_btn.c"/>
               <file category="sourceC" name="Libraries/Cordio/platform/targets/maxim/max32655/sources/pal_cfg.c"/>
               <file category="sourceC" name="Libraries/Cordio/platform/targets/maxim/max32655/sources/pal_codec.c"/>
               <file category="sourceC" name="Libraries/Cordio/platform/targets/maxim/max32655/sources/pal_crypto.c"/>
               <file category="sourceC" name="Libraries/Cordio/platform/targets/maxim/max32655/sources/pal_flash.c"/>
               <file category="sourceC" name="Libraries/Cordio/platform/targets/maxim/max32655/sources/pal_i2s.c"/>
               <file category="sourceC" name="Libraries/Cordio/platform/targets/maxim/max32655/sources/pal_led.c"/>
               <file category="sourceC" name="Libraries/Cordio/platform/targets/maxim/max32655/sources/pal_rtc.c"/>
               <file category="sourceC" name="Libraries/Cordio/platform/targets/maxim/max32655/sources/pal_sys.c"/>
               <file category="sourceC" name="Libraries/Cordio/platform/targets/maxim/max32655/sources/pal_timer.c"/>
               <file category="sourceC" name="Libraries/Cordio/platform/targets/maxim/max32655/sources/pal_twi.c"/>
               <file category="sourceC" name="Libraries/Cordio/platform/targets/maxim/max32655/sources/pal_uart.c"/>

               <file category="sourceC" name="Libraries/Cordio/thirdparty/uecc/uECC_ll.c"/>
               <file category="sourceC" name="Libraries/Cordio/thirdparty/uecc/uECC.c"/>			   

               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/baremetal/wsf_assert.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/baremetal/wsf_buf.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/baremetal/wsf_bufio.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/baremetal/wsf_cs.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/baremetal/wsf_detoken.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/baremetal/wsf_efs.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/baremetal/wsf_heap.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/baremetal/wsf_msg.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/baremetal/wsf_nvm.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/baremetal/wsf_os.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/baremetal/wsf_queue.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/baremetal/wsf_timer.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/baremetal/wsf_trace.c"/>
<!--                <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/cmsis_rtx/wsf_timer.c"/> -->
<!--               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/win32/wsf_assert.c"/>  
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/win32/wsf_heap.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/win32/wsf_nvm.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/win32/wsf_os.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/win32/wsf_timer.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/targets/win32/wsf_trace.c"/>  -->
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/util/bda.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/util/bstream.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/util/calc128.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/util/crc32.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/util/fcs.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/util/prand.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/util/print.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/util/terminal.c"/>
               <file category="sourceC" name="Libraries/Cordio/wsf/sources/util/wstr.c"/>

               <file category="library" name="Libraries/BlePhy/MAX32655/IAR/libphy_iar.a" condition="Startup IAR"/>
			   <file category="library" name="Libraries/BlePhy/MAX32655/ARM/libphy_keil.lib" condition="Startup ARM"/>


           </files>
         </component>
		 
<!--         <component Cgroup="Bluetooth LE - SDMA All" condition="MAX32655 Family">
            <description>MAX32655 Bluetooth Libraries - Using BLE Coprocessor</description>
               <RTE_Components_h>

				  #define ENABLE_SDMA 1
                </RTE_Components_h>
            <files>

           </files>
         </component>         
         <component Cgroup="Bluetooth LE - SDMA Advertising" condition="MAX32655 Family">
            <description>MAX32655 Bluetooth Libraries - Using BLE Coprocessor</description>
               <RTE_Components_h>

                  #define ENABLE_SDMA 1
                  #define SDMA_ADV 1
            </RTE_Components_h>

            <files>
		   
           </files>

        </component>

		 


         <component Cgroup="Bluetooth LE - SDMA Scanning" condition="MAX32655 Family">
            <description>MAX32655 Bluetooth Libraries - Using BLE Coprocessor</description>
               <RTE_Components_h>

                 #define ENABLE_SDMA 1
                  #define SDMA_SCN 1
            </RTE_Components_h>

            <files>

           </files>

         </component>  -->

	 
        
	 </bundle>


<!-- BLE Added here -->

      <bundle Cbundle="Maxim API" Cclass="Device" Cversion="1.0.0">
         <description>Maxim Developed Hardware Abstraction Layer</description>
         <doc>Doc/SDK_Documentation/doxygen.txt</doc>

