vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32655.pdsc
         <!-- MAX32655 Device Selection -->
         <component Cgroup="Startup" Cversion="1.0.0" condition="MAX32655 Family" >
            <description>System Startup for Maxim MAX32655 Microcontroller</description>
			
			
            <files>
               <!-- Include paths for the tools -->
               <file category="include" name="Libraries/CMSIS/Device/Maxim/MAX32655/Include/" version="1.0.0" />
               <file category="include" name="Libraries/PeriphDrivers/Include/MAX32655/" version="1.0.0" />

			   <file category="include" name="Libraries/PeriphDrivers/Source/ADC/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/AES/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/CRC/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/DMA/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/FLC/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/GPIO/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/I2C/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/I2S/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/ICC/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/LP/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/RTC/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SPI/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SYS/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/TMR/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/TRNG/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/UART/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/WDT/" version="1.0.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/WUT/" version="1.0.0"/>			   
			   <file category="include" name="Libraries/PeriphDrivers/Source/PT/" version="1.0.0"/>

               <!-- Keil/ARM device startup file and sub_main to call SystemInit -->			   
               <file category="sourceAsm" attr="config" version="1.0.0" name="Libraries/CMSIS/Device/Maxim/MAX32655/Source/ARM/startup_max32655.s" condition="Startup ARM" />
                <file category="sourceC" attr="config"  version="1.0.0" name="Libraries/CMSIS/Device/Maxim/MAX32655/Source/IAR/low_level_init.c" condition="Startup IAR" />
				
               <!-- GNUC/Eclipse device startup file -->
               <file category="sourceAsm" attr="config"  version="1.0.0" name="Libraries/CMSIS/Device/Maxim/MAX32655/Source/GCC/startup_max32655.S" condition="Startup GCC" />

               <!-- IAR device startup file, low level init and cmain.s -->  
               <file category="sourceAsm" attr="config" name="Libraries/CMSIS/Device/Maxim/MAX32655/Source/IAR/startup_max32655.s" condition="Startup IAR" version="1.0.0" />
               <file category="sourceC" attr="config"  version="1.0.0" name="Libraries/CMSIS/Device/Maxim/MAX32655/Source/IAR/low_level_init.c" condition="Startup IAR" />
               <file category="sourceAsm" attr="config"  version="1.0.0" name="Libraries/CMSIS/Device/Maxim/MAX32655/Source/IAR/cmain.s" condition="Startup IAR" />

               <!-- System, NVIC and device header files common to all platforms -->
               <file category="sourceC" attr="config"  version="1.0.0" name="Libraries/CMSIS/Device/Maxim/MAX32655/Source/system_max32655.c" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c" version="1.0.0" />
               <file category="header" attr="config" name="Libraries/CMSIS/Device/Maxim/MAX32655/Include/max32655.h" version="1.0.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_assert.c"  version="1.0.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_delay.c"  version="1.0.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_lock.c"  version="1.0.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me17.c"  version="1.0.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/sys_me17.c"  version="1.0.0" />	   
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c"  version="1.0.0" />		   
            </files>
         </component>

         <component Cgroup="ADC" condition="MAX32655 CMSIS ADC" Cversion="1.0.0"> 
         	 <description>ADC Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/ADC/adc_me17.c" version="1.0.0"/>
			   <!-- <file category="sourceC" name="Libraries/PeriphDrivers/Source/ADC/adc_common.c" version="1.0.0"/> -->
	           <file category="sourceC" name="Libraries/PeriphDrivers/Source/ADC/adc_reva.c" version="1.0.0"/>			   
            </files>
         </component>
		 
         <component Cgroup="TFT" condition="MAX32655 CMSIS TFT" Cversion="1.0.0"> 
         	 <description>TFT Interface</description>
            <files>
         	   <file category="sourceC" name="Libraries/Boards/MAX32655/Source/tft.c" version="1.0.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32655/Source/touchscreen.c" version="1.0.0"/>	   
            </files>
         </component>		 

         <component Cgroup="AES" condition="MAX32655 CMSIS AES" Cversion="1.0.0"> 
         	 <description>AES Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/AES/aes_me17.c" version="1.0.0"/>
	           <file category="sourceC" name="Libraries/PeriphDrivers/Source/AES/aes_revb.c" version="1.0.0"/>			   
            </files>
         </component>
		 
		 <component Cgroup="CRC" condition="MAX32655 CMSIS CRC" Cversion="1.0.0"> 
         	 <description>Camera Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/CRC/crc_me17.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/CRC/crc_reva.c" version="1.0.0"/>
            </files>
         </component>		 

         <component Cgroup="DMA" condition="MAX32655 CMSIS DMA" Cversion="1.0.0">
            <description>Standard DMA</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/DMA/dma_me17.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/DMA/dma_reva.c" version="1.0.0"/>
            </files>
         </component>

         <component Cgroup="FLC" condition="MAX32655 CMSIS FLC" Cversion="1.0.0" >
            <description> Flash Controller </description>
            <files>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_me17.c" version="1.0.0"/>			
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_common.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_reva.c" version="1.0.0"/>		
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_revb.c" version="1.0.0"/>				   			   
            </files>
         </component>
		 
		 <component Cgroup="GPIO" condition="MAX32655 CMSIS GPIO" Cversion="1.0.0">
            <description> GPIO </description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_me17.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_reva.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_common.c" version="1.0.0"/>		   
            </files>
         </component>
		 
