vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32655.pdsc
        <component Cgroup="I2C" condition="MAX32655 CMSIS I2C" Cversion="1.0.0">
            <description>I2C Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2C/i2c_me17.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2C/i2c_reva.c" version="1.0.0"/>			   
            </files>
         </component>		 
		 
        <component Cgroup="I2S" condition="MAX32655 CMSIS I2S" Cversion="1.0.0">
            <description>I2S Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2S/i2s_me17.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2S/i2s_reva.c" version="1.0.0"/>			   
            </files>
         </component>		 		 

         <component Cgroup="ICC" condition="MAX32655 CMSIS ICC" Cversion="1.0.0">
            <description>Instruction Cache Controller</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_me17.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_reva.c" version="1.0.0"/>
			   <!-- <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_common.c" version="1.0.0"/> -->
            </files>
         </component>		 
		 
         <component Cgroup="Low Power" condition="MAX32655 CMSIS Low Power" Cversion="1.0.0">
            <description>Low Power API</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/LP/lp_me17.c" version="1.0.0"/>			   
            </files>
         </component>		 
		 
         <component Cgroup="RTC" condition="MAX32655 CMSIS RTC" Cversion="1.0.0">
            <description>Real-Time Clock</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/RTC/rtc_me17.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/RTC/rtc_reva.c" version="1.0.0"/>			   
            </files>
         </component>

         <component Cgroup="SPI" condition="MAX32655 CMSIS SPI" Cversion="1.0.0">
            <description>SPI Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPI/spi_me17.c" version="1.0.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPI/spi_reva.c" version="1.0.0"/>			   
            </files>
         </component>

         <component Cgroup="SYS" condition="MAX32655 CMSIS SYS" Cversion="1.0.0">
            <description>SYS Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/sys_me17.c" version="1.0.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me17.c" version="1.0.0"/>
               <!-- <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_es17.c" version="1.0.0"/> -->				   
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c" version="1.0.0"/>	
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_lock.c" version="1.0.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_delay.c" version="1.0.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_assert.c" version="1.0.0"/>

            </files>
         </component>

         <component Cgroup="Timers" condition="MAX32655 CMSIS TIMER" Cversion="1.0.0">
            <description>32-Bit Timers</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_me17.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_revb.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_common.c" version="1.0.0"/>			   
            </files>
         </component>

         <component Cgroup="TRNG" condition="MAX32655 CMSIS TRNG" Cversion="1.0.0">
            <description>TRNG</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/TRNG/trng_me17.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TRNG/trng_revb.c" version="1.0.0"/>		   
            </files>
         </component>

         <component Cgroup="UART" condition="MAX32655 CMSIS UART" Cversion="1.0.0">
            <description>UART Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_me17.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_revb.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_common.c" version="1.0.0"/>
            </files>
         </component>

         <component Cgroup="WDT" condition="MAX32655 CMSIS WDT" Cversion="1.0.0">
            <description>Watchdog Timers</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_me17.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_revb.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_common.c" version="1.0.0"/>
            </files>
         </component>		 

         <component Cgroup="WUT" condition="MAX32655 CMSIS WUT" Cversion="1.0.0">
            <description>Wakeup Timer</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/WUT/wut_me17.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WUT/wut_reva.c" version="1.0.0"/>
            </files>
         </component>

         <component Cgroup="PT" condition="MAX32655 CMSIS PT" Cversion="1.0.0">
            <description>Wakeup Timer</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/PT/pt_me17.c" version="1.0.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/PT/pt_reva.c" version="1.0.0"/>
            </files>
         </component>
		 
      </bundle>
	  
      <bundle Cbundle="MAX32655 BSP" Cclass="BSP" Cversion="1.0.0">
         <description>MAX32655 Evaluation Kit Board Support Package</description>
         <doc>Doc/MAX32655_EvKit.txt</doc>
            <component Cgroup="EvKit V1" condition="MAX32655 BSP DEP">
		    <!-- <component Cgroup="EvKit V1"> -->
            <description>MAX32655 Evaluation Kit Board Setup</description>
            <RTE_Components_h>
               #define BOARD EvKit_V1 /* Target Board */
            </RTE_Components_h>
            <files>
			   <file category="include" name="Libraries/Boards/MAX32655/EvKit_V1/Include/" version="1.0.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32655/EvKit_V1/Source/board.c" version="1.0.0"/>	   			   
               <file category="include" name="Libraries/Boards/MAX32655/Include/" version="1.0.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32655/Source/led.c" version="1.0.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32655/Source/pb.c" version="1.0.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32655/Source/stdio.c" version="1.0.0"/>
<!--               <file category="sourceC" name="Libraries/Boards/MAX32655/Source/tft.c" version="1.0.0"/> -->
<!--               <file category="sourceC" name="Libraries/Boards/MAX32655/Source/touchscreen.c" version="1.0.0"/> -->
           </files>
         </component>
      </bundle> 
   </components>
</package>